[
  {
    "slug": "online-learning-platform",
    "title": "Online Learning Platform (Techtok)",
    "description": "Interactief online learning platform voor basisschoolleerlingen en leerkrachten.",
    "role": "UX Designer (onderzoek, prototyping, testen)",
    "image": "/images/techtok-mini.png",
    "image2": "/images/research.png",
    "image3": "/images/pages.png",
    "image4": "/images/overview.svg",
    "image5": "/images/coursestart.svg",
    "image6": "/images/coursefinish.svg",
    "image7": "/images/class.svg",
    "background": "#6a4c93",
    "overview": "Het project omvatte het ontwerp van een interactief online learning platform, speciaal voor basisschoolleerlingen en hun leerkrachten. Het doel was een gebruiksvriendelijke en veilige omgeving te creëren die leren leuk en effectief maakt voor kinderen, en overzichtelijk en functioneel is voor leerkrachten.",
    "problem": "Voor kinderen: beperkte cognitieve en motorische vaardigheden, korte aandachtsspanne.\nVoor leerkrachten: behoefte aan overzicht, efficiënt beheer van lessen en voortgang.\nDoel: Een platform ontwerpen dat kinderen op een toegankelijke manier laat leren, terwijl leerkrachten efficiënt lesmateriaal kunnen beheren, voortgang volgen en leerlingen ondersteunen.",
    "research": "Desk Research & Marktanalyse: Analyse van bestaande kindvriendelijke platforms zoals National Geographic Kids, Spele.nl, PBS KIDS.\nBelangrijke inzichten: weinig tekst, grote fonts, duidelijke knoppen, simpele taal, rustige interface.\nExpert & Stakeholder Feedback: UX-experts adviseerden over zowel Kids Portal als Teacher Portal.\nFeedback van leerkrachten en opdrachtgevers werd meegenomen.\nUsability Test (Kids Portal): Prototype getest op basisschoolleerlingen. Resultaten: knoppen intuïtief, navigatie duidelijk, interacties werkten goed.\nDesignprincipes: Kids Portal: cognitive abilities, motor skills, attention span, emotional responses, simplicity, interactive elements, age-appropriate content, safety & privacy, consistent feedback & reward.\nTeacher Portal: eenvoud, consistentie, duidelijke hiërarchie, toegankelijkheid, feedback en responsiviteit, C.R.A.P.-principes, Primacy effect.",
    "architecture": "Kids Portal: Home, lessen, games, voortgang. Minimalistische interface, duidelijke knoppen, interactieve elementen.\nTeacher Portal: Dashboard met overzicht van klassen en leerlingen. Functionaliteiten: klassencode voor accounts, voor- en achternaam leerlingen zichtbaar, klasbeheer door docent, weekdoelen / verplichte lessen, progress bars & voortgang per onderwerp, klassenoverdracht, mogelijkheid om naar Kinderomgeving te schakelen. Structuur: consistentie in navigatie en layout, overzichtelijk, focus op belangrijke functies.",
    "wireframes": "Low- en mid-fidelity wireframes in Figma. Kids Portal: kleurrijk, speels, intuïtief. Teacher Portal: rustig, overzichtelijk, professioneel, Techtok branding toegepast. Iteraties op basis van feedback van experts en gebruikers.",
    "visualDesign": "Kids Portal: kleurrijk, speels, intuïtief. Teacher Portal: rustig, overzichtelijk, professioneel, Techtok branding toegepast.",
    "testing": "Iteratief testen met echte gebruikers is cruciaal. Afwegen van tegenstrijdige feedback van stakeholders. Toepassen van designprincipes voor zowel kinderen als docenten.",
    "finalDesigns": "Afwegingen gemaakt bij tegenstrijdige feedback. Visuele elementen aangepast: cursuskaartjes, kleurgebruik, hiërarchie van informatie. Kids Portal: interactief, overzichtelijk, kindvriendelijk. Teacher Portal: overzichtelijk, duidelijk, met functies voor efficiënt klasbeheer en voortgangsmonitoring.",
    "learnings": "Iteratief testen met echte gebruikers is cruciaal. Afwegen van tegenstrijdige feedback van stakeholders. Toepassen van designprincipes voor zowel kinderen als docenten. Belang van balans tussen speelsheid en overzicht in UX.",
    "prototypeLinks": {
      "kids": "https://www.figma.com/proto/nVaW5DJGjFS4fzkPyTrD0A/techtok-designs?page-id=533%3A2574&node-id=548-1606&viewport=291%2C126%2C0.06&t=s1fe5MykeBjsOcU6-1&scaling=contain&content-scaling=fixed&starting-point-node-id=548%3A1606",
      "teachers": "https://www.figma.com/proto/nVaW5DJGjFS4fzkPyTrD0A/techtok-designs?page-id=1045%3A3047&node-id=1125-3741&viewport=41%2C706%2C0.13&t=fwx1RDdiT4gnBtb0-1&scaling=contain&content-scaling=fixed&starting-point-node-id=1125%3A3741"
  }
},
  {
    "slug": "project-2",
    "title": "Project 2",
    "description": "Korte omschrijving project 2",
    "role": "UX Designer",
    "image": "/images/project2.jpg",
    "background": "#22c55e",
    "overview": "Overzicht van project 2, volledig uitgeschreven met alle details en context.",
    "problem": "",
    "research": "",
    "architecture": "",
    "wireframes": "",
    "visualDesign": "",
    "testing": "",
    "finalDesigns": "",
    "learnings": "",
    "prototypeLinks": {
      "kids": "",
      "teachers": ""
    }
  },
  {
    "slug": "project-3",
    "title": "Project 3",
    "description": "Korte omschrijving project 3",
    "role": "UX Designer",
    "image": "/images/project3.jpg",
    "background": "#16a34a",
    "overview": "Volledige beschrijving van project 3, alle context en details.",
    "problem": "Probleemstelling en doelstellingen van project 3.",
    "research": "Onderzoeksbevindingen en insights van project 3.",
    "architecture": "Structuur en functies van project 3.",
    "wireframes": "Wireframes van project 3.",
    "visualDesign": "Visual design van project 3.",
    "testing": "Usability testing resultaten van project 3.",
    "finalDesigns": "Finale ontwerpen van project 3.",
    "learnings": "Belangrijkste learnings van project 3.",
    "prototypeLinks": {
      "kids": "",
      "teachers": ""
    }
  },
  {
    "slug": "project-4",
    "title": "Project 4",
    "description": "Korte omschrijving project 4",
    "role": "UX Designer",
    "image": "/images/project4.jpg",
    "background": "#3b82f6",
    "overview": "Volledige beschrijving van project 4 met alle details en context.",
    "problem": "Probleemstelling en doelstellingen van project 4.",
    "research": "Onderzoeksbevindingen van project 4.",
    "architecture": "Structuur en functies van project 4.",
    "wireframes": "Wireframes van project 4.",
    "visualDesign": "Visual design van project 4.",
    "testing": "Usability testing resultaten van project 4.",
    "finalDesigns": "Finale ontwerpen van project 4.",
    "learnings": "Belangrijkste learnings van project 4.",
    "prototypeLinks": {
      "kids": "",
      "teachers": ""
    }
  }
]
