[
  {
    "slug": "online-learning-platform",
    "title": "Online Learning Platform (Techtok)",
    "description": "Interactief online learning platform voor basisschoolleerlingen en leerkrachten.",
    "explanation": "We hadden opdrachtgevers die een leerplatform voor basisscholen, groep 7 en 8, wouden creeeren. Mijn rol in dat project was om een design te maken van de kinderomgeving, waar de kinderen hun opdrachten konden uitvoeren, en een begin maken van een design van een omgeving voor de docenten. Ik heb de omgeving voor de kinderen ook getest bij een basisschool, met groep 8 leerlingen.",
    "role": "UX Designer (onderzoek, prototyping, testen)",
    "image": "/images/techtok-mini.png",
    "image2": "/images/research.png",
    "image3": "/images/pages.png",
    "image4": "/images/overview.svg",
    "image5": "/images/coursestart.svg",
    "image6": "/images/coursefinish.svg",
    "image7": "/images/class.svg",
    "background": "#ffa3a3",
    "overview": "Het project omvatte het ontwerp van een interactief online learning platform, speciaal voor basisschoolleerlingen en hun leerkrachten. Het doel was een gebruiksvriendelijke en veilige omgeving te creëren die leren leuk en effectief maakt voor kinderen, en overzichtelijk en functioneel is voor leerkrachten.",
    "problem": "Voor kinderen: beperkte cognitieve en motorische vaardigheden, korte aandachtsspanne.\nVoor leerkrachten: behoefte aan overzicht, efficiënt beheer van lessen en voortgang.\nDoel: Een platform ontwerpen dat kinderen op een toegankelijke manier laat leren, terwijl leerkrachten efficiënt lesmateriaal kunnen beheren, voortgang volgen en leerlingen ondersteunen.",
    "research": "Desk Research & Marktanalyse: Analyse van bestaande kindvriendelijke platforms zoals National Geographic Kids, Spele.nl, PBS KIDS.\nBelangrijke inzichten: weinig tekst, grote fonts, duidelijke knoppen, simpele taal, rustige interface.\nExpert & Stakeholder Feedback: UX-experts adviseerden over zowel Kids Portal als Teacher Portal.\nFeedback van leerkrachten en opdrachtgevers werd meegenomen.\nUsability Test (Kids Portal): Prototype getest op basisschoolleerlingen. Resultaten: knoppen intuïtief, navigatie duidelijk, interacties werkten goed.\nDesignprincipes: Kids Portal: cognitive abilities, motor skills, attention span, emotional responses, simplicity, interactive elements, age-appropriate content, safety & privacy, consistent feedback & reward.\nTeacher Portal: eenvoud, consistentie, duidelijke hiërarchie, toegankelijkheid, feedback en responsiviteit, C.R.A.P.-principes, Primacy effect.",
    "architecture": "Kids Portal: Home, lessen, games, voortgang. Minimalistische interface, duidelijke knoppen, interactieve elementen.\nTeacher Portal: Dashboard met overzicht van klassen en leerlingen. Functionaliteiten: klassencode voor accounts, voor- en achternaam leerlingen zichtbaar, klasbeheer door docent, weekdoelen / verplichte lessen, progress bars & voortgang per onderwerp, klassenoverdracht, mogelijkheid om naar Kinderomgeving te schakelen. Structuur: consistentie in navigatie en layout, overzichtelijk, focus op belangrijke functies.",
    "wireframes": "Low- en mid-fidelity wireframes in Figma. Kids Portal: kleurrijk, speels, intuïtief. Teacher Portal: rustig, overzichtelijk, professioneel, Techtok branding toegepast. Iteraties op basis van feedback van experts en gebruikers.",
    "visualDesign": "Kids Portal: kleurrijk, speels, intuïtief. Teacher Portal: rustig, overzichtelijk, professioneel, Techtok branding toegepast.",
    "testing": "Iteratief testen met echte gebruikers is cruciaal. Afwegen van tegenstrijdige feedback van stakeholders. Toepassen van designprincipes voor zowel kinderen als docenten.",
    "finalDesigns": "Afwegingen gemaakt bij tegenstrijdige feedback. Visuele elementen aangepast: cursuskaartjes, kleurgebruik, hiërarchie van informatie. Kids Portal: interactief, overzichtelijk, kindvriendelijk. Teacher Portal: overzichtelijk, duidelijk, met functies voor efficiënt klasbeheer en voortgangsmonitoring.",
    "learnings": "Iteratief testen met echte gebruikers is cruciaal. Afwegen van tegenstrijdige feedback van stakeholders. Toepassen van designprincipes voor zowel kinderen als docenten. Belang van balans tussen speelsheid en overzicht in UX.",
    "prototypeLinks": {
      "prot1": "https://www.figma.com/proto/nVaW5DJGjFS4fzkPyTrD0A/techtok-designs?page-id=533%3A2574&node-id=548-1606&viewport=291%2C126%2C0.06&t=s1fe5MykeBjsOcU6-1&scaling=contain&content-scaling=fixed&starting-point-node-id=548%3A1606",
      "prot2": "https://www.figma.com/proto/nVaW5DJGjFS4fzkPyTrD0A/techtok-designs?page-id=1045%3A3047&node-id=1125-3741&viewport=41%2C706%2C0.13&t=fwx1RDdiT4gnBtb0-1&scaling=contain&content-scaling=fixed&starting-point-node-id=1125%3A3741"
    }
  },
  {
    "slug": "project-2",
    "title": "Studenten voortgangssysteem voor docenten (Anubis)",
    "description": "Platform voor docenten om voortgang van studenten bij te houden.",
    "explanation": "Een systeem om de voortgang van studenten bij te houden, ontworpen tijdens een project voor mijn opleiding. Ik maakte de wireframes en designs, met focus op overzicht, duidelijke navigatie en logische hiërarchie. Hoewel dit nog geen diepgaand UX-onderzoek bevatte, leerde ik hoe ik complexe informatie overzichtelijk kan presenteren en gebruiksvriendelijke dashboards kan ontwerpen.",
    "role": "Wireframes en design gemaakt, focus op overzichtelijk dashboard",
    "image": "/images/logoanubis.svg",
    "image2": "/images/BMC.png",
    "image3": "/images/file.png",
    "image4": "/images/profile.png",
    "background": "#c8eb84",
    "overview": "Het project omvatte het ontwerp van een platform voor docenten om de voortgang van studenten bij te houden. Het doel was een overzichtelijk dashboard te maken dat complexe informatie op een gebruiksvriendelijke manier presenteert.",
    "problem": "Voor docenten: behoefte aan overzicht over meerdere studenten, inzicht in individuele voortgang, en eenvoudig beheer van opdrachten.\nDoel: Een dashboard ontwerpen dat efficiënt gebruik mogelijk maakt, informatie duidelijk hiërarchiseert en de workflow van docenten ondersteunt.",
    "research": "Desk research: Analyse van bestaande onderwijsdashboards en student tracking tools.\nStakeholder feedback: In teamverband besproken welke functionaliteiten essentieel zijn voor docenten.\nBeperkingen: Geen uitgebreid UX-onderzoek beschikbaar, aangezien dit een vroege projectfase was.",
    "architecture": "Dashboard: overzicht van klassen, studenten en voortgang.\nStudent detailpagina: individueel overzicht met opdrachten, scores en voortgangsstatistieken.\nFunctionaliteiten: sorteerbare lijsten, duidelijke hiërarchie van informatie, visuele voortgangsbalken.",
    "wireframes": "Low- en mid-fidelity wireframes in Figma, met focus op overzicht en logische navigatie. Structuur is modulair en consistent voor herbruikbaarheid in andere dashboards.",
    "visualDesign": "Rustige, overzichtelijke interface met consistente typografie en kleurgebruik. Gebruik van iconografie om functies snel herkenbaar te maken.",
    "testing": "Informele feedback binnen het team en van medestudenten over de duidelijkheid en navigatie. Iteraties op basis van opmerkingen over hiërarchie en overzichtelijkheid.",
    "finalDesigns": "Het dashboard werd geoptimaliseerd voor leesbaarheid, consistente kleurgebruik, en een duidelijke structuur die eenvoudig uit te breiden is voor nieuwe functionaliteiten.",
    "learnings": "Het project leerde mij hoe ik complexe informatie kan structureren en overzichtelijk presenteren. Ik heb ervaring opgedaan met dashboarddesign en het visualiseren van data, en geleerd hoe wireframes en iteratief ontwerpen werken in een praktische context.",
    "prototypeLinks": {
      "prot1": "https://www.figma.com/proto/AVWm03LiJmdxTS01RKVuNv/Anubis-schetsen?page-id=1%3A2699&node-id=1-3953&viewport=1089%2C-6007%2C0.14&t=FAVewH0vl4o6GJMR-1&scaling=contain&content-scaling=fixed&starting-point-node-id=1%3A3953&show-proto-sidebar=1",
      "prot2": "https://www.figma.com/proto/AVWm03LiJmdxTS01RKVuNv/Anubis-schetsen?page-id=1%3A2699&node-id=1-3958&viewport=639%2C-2631%2C0.07&t=e5QBz1i5k9dsvMrF-1&scaling=contain&content-scaling=fixed&starting-point-node-id=1%3A3958&show-proto-sidebar=1"
    }
  },
  {
    "slug": "project-3",
    "title": "Boer Bert’s Camping Website",
    "description": "Een website ontwerpen voor een fictieve camping, bedoeld voor iemand zonder kennis van websites.",
    "explanation": "Een website voor een fictieve camping, ontworpen en gebouwd in teamverband. Het project was gericht op iemand zonder technische kennis, wat het een interessante uitdaging maakte om een eenvoudige, overzichtelijke en toegankelijke website te ontwerpen. Ik maakte de designs in Figma en bouwde de frontend, waarbij ik leerde hoe design en gebruiksvriendelijkheid samenkomen in een praktisch project.",
    "role": "Focus op structuur en gebruiksvriendelijkheid; wireframes en designs in Figma gemaakt",
    "image": "/images/boerbert.svg",
    "image2": "/images/Campinghome.png",
    "image3": "/images/campinginput.png",
    "image4": "/images/campingbottom.svg",
    "background": "#8fb8e2",
    "overview": "Het project was het ontwerpen en bouwen van een website voor een fictieve camping. Het doel was een gebruiksvriendelijke website te creëren voor iemand zonder technische kennis, waarin bezoekers gemakkelijk informatie kunnen vinden en reserveringen kunnen maken.",
    "problem": "Voor de opdrachtgever: geen ervaring met websites, behoefte aan een eenvoudige en overzichtelijke site.\nVoor bezoekers: snelle toegang tot informatie over de camping, accommodaties en faciliteiten.\nDoel: Een toegankelijke en duidelijke website ontwerpen die zowel functioneel als visueel aantrekkelijk is.",
    "research": "Benchmarking: Analyse van bestaande camping- en vakantieparkenwebsites voor structuur, navigatie en content.\nTeam feedback: Besproken welke functies essentieel zijn, zoals reserveren, contactinformatie en overzicht van faciliteiten.\nBeperkingen: Eerste echte opdracht voor een externe 'klant', dus veel aannames gemaakt over behoeften en gebruiksvriendelijkheid.",
    "architecture": "Homepagina: overzicht van faciliteiten en belangrijke informatie.\nReserveringspagina: eenvoudig formulier voor reserveringen.\nPagina-indeling: duidelijke secties, minimalistisch menu en consistente navigatie.",
    "wireframes": "Low-fidelity wireframes in Figma met focus op overzicht en duidelijke hiërarchie van informatie. Iteraties op basis van teamfeedback.",
    "visualDesign": "Eenvoudige en toegankelijke interface, gebruik van duidelijke typografie en kleur om de belangrijkste informatie te benadrukken. Iconen en afbeeldingen ondersteunen navigatie en gebruikerservaring.",
    "testing": "Informele testen binnen het team: navigatie, leesbaarheid en structuur van content werden beoordeeld.",
    "finalDesigns": "Visueel eenvoudig, functioneel en duidelijk. Belangrijke functies zoals reserveren en contactinformatie zijn direct zichtbaar en gemakkelijk te gebruiken.",
    "learnings": "Dit project gaf mijn eerste ervaring met een 'echte' klant, ook al was het fictief. Ik leerde hoe ik gebruikersgerichte keuzes kan maken en een project kan combineren van design tot frontend implementatie.",
    "prototypeLinks": {
      "prot1": "https://www.figma.com/proto/WjBseIED0wunTdN8NOLOi7/Web-design-~Marten?page-id=116%3A3&node-id=148-45&p=f&viewport=-2329%2C-2767%2C0.32&t=TONcBZA9AoNwgxwY-1&scaling=contain&content-scaling=fixed&starting-point-node-id=148%3A45",
      "prot2": ""
    }
  },
  {
    "slug": "project-4",
    "title": "Portfolio Website (eerste ICT-project)",
    "description": "Persoonlijke portfolio-website die ook als CV functioneert.",
    "explanation": "",
    "role": "Zelfstandig ontworpen en ontwikkeld. Focus op overzicht, navigatie en presentatie van informatie",
    "image": "/images/portfolio.png",
    "image2": "/images/firstdesign.png",
    "image3": "/images/Overmij.png",
    "image4": "/images/Werk.png",
    "image5": "/images/portfoliologin.png",
    "background": "#fff2a0",
    "overview": "Mijn eerste persoonlijke portfolio-website die ook als CV functioneert. Het doel was een overzichtelijk platform te creëren waar mijn vaardigheden, projecten en contactinformatie op een consistente manier worden gepresenteerd.",
    "problem": "Voor mezelf: een plek om projecten te tonen en mezelf te presenteren aan toekomstige stagebedrijven.\nDoel: een gestructureerde, overzichtelijke en goed navigeerbare website ontwerpen die mijn vaardigheden en projecten professioneel presenteert.",
    "research": "Inspiratie: Analyse van bestaande portfolio-websites om structuur, navigatie en visuele presentatie te leren.\nFeedback: Informele feedback van medestudenten over leesbaarheid en overzicht.",
    "architecture": "Homepagina: Navigatie naar verschillende pagina's.\nCarrierepagina: overzicht van mijn werkervaring.\nAbout pagina: korte bio, vaardigheden en contactinformatie. \nProjecten pagina: overicht van projecten die ik zal doen met mijn ICT kennis. \nLog in: Een manier voor mijzelf om nieuwe projecten toe te voegen. \nSportpagina: een pagina met sport en mogelijk andere hobbies. \nInformatie pagina: Informatie die ik nodig had om deze portfolio pagina te maken.",
    "wireframes": "Eerste schetsen en low-fidelity wireframes in Figma. Iteraties op basis van eigen observaties en peer feedback.",
    "visualDesign": "Gebruik van een rustige kleurenschema, consistente typografie en duidelijke hiërarchie. Navigatie eenvoudig en overzichtelijk gehouden.",
    "testing": "Informele gebruikerstests bij medestudenten over navigatie en overzichtelijkheid. Iteratief verbeterd op basis van feedback.",
    "finalDesigns": "Overzichtelijk en consistent, met focus op informatiepresentatie en eenvoudige navigatie. Legde de basis voor toekomstige UX-projecten.",
    "learnings": "Mijn eerste stap in UX-design en webontwikkeling. Leerde principes van consistentie, hiërarchie, navigatie en het presenteren van informatie op een overzichtelijke manier.",
    "prototypeLinks": {
      "prot1": "https://www.figma.com/design/7c2thvAH04T5AGL3h5lJTs/Portfolio-Website-jaar-1?node-id=1669-162202&t=cMubKmrKxYotm92K-1",
      "prot2": ""
    }
  }
]
